{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "import os\n",
    "\n",
    "graph = Graph(password=os.environ.get('NEO4J_PW'))\n",
    "\n",
    "\n",
    "def create_rel_to_parent(child_id, parent_id, timestamp, graph, via):\n",
    "    graph.run(\n",
    "        \"MATCH (child:User {user_id: {child_id}}), (parent:User {user_id: {parent_id}}) \" +\n",
    "        \"CREATE UNIQUE (child)-[:ADOPTED {timestamp: {timestamp}, via: {via}}]->(parent)\",\n",
    "        child_id=child_id, parent_id=parent_id, timestamp=timestamp, via=via\n",
    "    )\n",
    "    # print(\"created: \", child_id, \" --> \", parent_id)\n",
    "\n",
    "\n",
    "def assign_parent(user_id):\n",
    "\n",
    "    first_tweet_props = graph.run(\n",
    "        \"MATCH (:User {user_id: {user_id}})-[:TWEETED]->(tweet) \" +\n",
    "        \"OPTIONAL MATCH (tweet)-[:NATIVELY_RETWEETS]->(original_tweet)<-[:TWEETED]-(retweeted_user:User) \" +\n",
    "        \"OPTIONAL MATCH (tweet)-[:QUOTES]->(original_tweet)<-[:TWEETED]-(quoted_user:User) \" +\n",
    "        \"OPTIONAL MATCH (tweet)-[:REPLIES]->(original_tweet)<-[:TWEETED]-(replied_to_user:User) \"\n",
    "        \"RETURN tweet.created_at, original_tweet.tweet_id, retweeted_user.user_id, quoted_user.user_id, replied_to_user.user_id \" +\n",
    "        \"ORDER BY tweet.created_at ASC LIMIT 1\",\n",
    "        user_id=user_id\n",
    "    ).data()\n",
    "\n",
    "    ts = first_tweet_props[0]['tweet.created_at']\n",
    "    original_tweet_id = first_tweet_props[0]['original_tweet.tweet_id']\n",
    "    retweeted_user_id = first_tweet_props[0]['retweeted_user.user_id']\n",
    "    quoted_user_id = first_tweet_props[0]['quoted_user.user_id']\n",
    "    replied_to_user_id = first_tweet_props[0]['replied_to_user.user_id']\n",
    "    \n",
    "    # print(first_tweet_props)\n",
    "\n",
    "    friends = graph.run(\n",
    "        \"MATCH (:User {user_id: {user_id}})-[f:FOLLOWS]->(u) \" +\n",
    "        \"WHERE f.followed_after < {timestamp} \" +\n",
    "        \"RETURN u.user_id\",\n",
    "        user_id=user_id, timestamp=ts\n",
    "    )\n",
    "\n",
    "    friend_ids = [friend['u.user_id'] for friend in friends]\n",
    "    \n",
    "    if retweeted_user_id is not None:\n",
    "        if retweeted_user_id in friend_ids:\n",
    "            create_rel_to_parent(user_id, retweeted_user_id, ts, graph, via='retweeted tweet of friend')\n",
    "        else:  # if retweeted user is not followed look whether this user was retweeted by somebody who the focal user follows\n",
    "            middleman = graph.evaluate(\n",
    "                \"OPTIONAL MATCH (retweeted_user:User {user_id: {retweeted_user_id}})-[:TWEETED]->(ot:Tweet)<-[:NATIVELY_RETWEETS]-(t:Tweet)<-[:TWEETED]-(retweeter:User) \" +\n",
    "                \"WHERE t.created_at < {timestamp} AND ot.tweet_id = {original_tweet_id} AND retweeter.user_id IN {friend_ids} \" +\n",
    "                \"RETURN retweeter.user_id ORDER BY t.timestamp DESC LIMIT 1\",\n",
    "                retweeted_user_id=retweeted_user_id, timestamp=ts, friend_ids=friend_ids, original_tweet_id=original_tweet_id\n",
    "            )\n",
    "            if middleman is not None:\n",
    "                create_rel_to_parent(user_id, middleman, ts, graph, via='retweeted retweet by friend')\n",
    "            else:  # if no middleman can be found, the parent is the retweeted user\n",
    "                create_rel_to_parent(user_id, retweeted_user_id, ts, graph, via='retweeted tweet not by friend')\n",
    "    elif quoted_user_id is not None:\n",
    "        # almost same procedure as for retweets\n",
    "        if quoted_user_id in friend_ids:\n",
    "            create_rel_to_parent(user_id, quoted_user_id, ts, graph, via='quoted tweet by friend')\n",
    "        else:\n",
    "            middleman = graph.evaluate(\n",
    "                \"OPTIONAL MATCH (quoted_user:User {user_id: {quoted_user_id}})-[:TWEETED]->(ot:Tweet)<-[:NATIVELY_RETWEETS]-(t:Tweet)<-[:TWEETED]-(retweeter:User) \" +\n",
    "                \"WHERE t.created_at < {timestamp} AND ot.tweet_id = {original_tweet_id} AND retweeter.user_id IN {friend_ids} \" +\n",
    "                \"RETURN retweeter.user_id ORDER BY t.timestamp DESC LIMIT 1\",\n",
    "                quoted_user_id=quoted_user_id, timestamp=ts, friend_ids=friend_ids, original_tweet_id=original_tweet_id\n",
    "            )\n",
    "            if middleman is not None:\n",
    "                create_rel_to_parent(user_id, middleman, ts, graph, via='quoted retweet by friend')\n",
    "            else:  # if no middleman can be found, the parent is the quoted user\n",
    "                create_rel_to_parent(user_id, quoted_user_id, ts, graph, via='quoted tweet not by friend')\n",
    "    elif replied_to_user_id is not None:\n",
    "        source_tweet = graph.evaluate(\n",
    "            \"OPTIONAL MATCH (:User {user_id: {replied_to_user_id}})-[:TWEETED]->(t) \" +\n",
    "            # explicitly exclude tweets not in the dataset which will have NULL for timestamp\n",
    "            \"WHERE t.created_at IS NOT NULL AND t.created_at < {timestamp} \" +\n",
    "            \"RETURN t.created_at ORDER BY t.created_at DESC LIMIT 1\",\n",
    "            replied_to_user_id=replied_to_user_id, timestamp=ts\n",
    "        )\n",
    "        if source_tweet is not None:  # test whether mentioned user posted link already\n",
    "\n",
    "            if replied_to_user_id in friend_ids:\n",
    "                create_rel_to_parent(user_id, replied_to_user_id, ts, graph, via='replied to tweet by friend')\n",
    "\n",
    "            else:  # test for retweets/quotes of/replies to mentioned user in timeline of focal user\n",
    "                middleman = graph.evaluate(\n",
    "                    \"OPTIONAL MATCH (replied_to_user:User {user_id: {replied_to_user_id}})-[:TWEETED]->(ot:Tweet)<--(t:Tweet)<-[:TWEETED]-(middleman:User)) \" +\n",
    "                    \"WHERE t.created_at < {timestamp} AND ot.tweet_id = {original_tweet_id} AND middleman.user_id IN {friend_ids} \" +\n",
    "                    \"RETURN middleman.user_id ORDER BY t.created_at DESC LIMIT 1\",\n",
    "                    replied_to_user_id=replied_to_user_id, timestamp=ts, friend_ids=friend_ids, original_tweet_id=original_tweet_id\n",
    "                )\n",
    "                if middleman is not None:\n",
    "                    create_rel_to_parent(user_id, middleman, ts, graph, via='replied to tweet via friend')\n",
    "    else:\n",
    "        last_active_friend_id = graph.evaluate(\n",
    "            \"OPTIONAL MATCH (t:Tweet)<-[:TWEETED]-(u) \" +\n",
    "            \"WHERE t.timestamp < {timestamp} AND u.user_name IN {friend_ids} \" +\n",
    "            # excludes tweets without a timestamp, i.e. tweets that have not been retrieved by the search, i.e. most likely w/o the link\n",
    "            \"RETURN u.user_name ORDER BY t.timestamp DESC LIMIT 1\",\n",
    "            timestamp=ts, friend_ids=friend_ids\n",
    "        )\n",
    "        if last_active_friend_id is not None:\n",
    "            create_rel_to_parent(user_id, last_active_friend_id, ts, graph, via='last tweet seen with link')\n",
    "\n",
    "    return user_id"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "50\n",
      "100\n",
      "150\n",
      "200\n",
      "250\n",
      "300\n",
      "350\n",
      "400\n",
      "450\n",
      "500\n",
      "550\n",
      "600\n",
      "650\n",
      "700\n",
      "750\n",
      "800\n",
      "850\n",
      "900\n",
      "950\n",
      "1000\n",
      "1050\n",
      "1100\n",
      "1150\n",
      "1200\n",
      "1250\n",
      "1300\n",
      "1350\n",
      "1400\n",
      "1450\n",
      "1500\n",
      "1550\n",
      "1600\n",
      "1650\n",
      "1700\n",
      "1750\n",
      "1800\n",
      "1850\n",
      "1900\n",
      "1950\n",
      "2000\n",
      "2050\n",
      "2100\n",
      "2150\n",
      "2200\n",
      "2250\n",
      "2300\n",
      "2350\n",
      "2400\n",
      "2450\n",
      "2500\n",
      "2550\n",
      "2600\n",
      "2650\n",
      "2700\n",
      "2750\n",
      "2800\n",
      "2850\n",
      "2900\n",
      "2950\n",
      "3000\n",
      "3050\n",
      "3100\n",
      "3150\n",
      "3200\n",
      "3250\n",
      "3300\n",
      "3350\n",
      "3400\n",
      "3450\n",
      "3500\n",
      "3550\n",
      "3600\n",
      "3650\n",
      "3700\n",
      "3750\n",
      "3800\n",
      "3850\n",
      "3900\n",
      "3950\n",
      "4000\n",
      "4050\n",
      "4100\n",
      "4150\n",
      "4200\n",
      "4250\n",
      "4300\n",
      "4350\n",
      "4400\n",
      "4450\n",
      "4500\n",
      "4550\n",
      "4600\n",
      "4650\n",
      "4700\n",
      "4750\n",
      "4800\n",
      "4850\n",
      "4900\n",
      "4950\n",
      "5000\n",
      "5050\n",
      "5100\n",
      "5150\n",
      "5200\n",
      "5250\n",
      "5300\n",
      "5350\n",
      "5400\n",
      "5450\n",
      "5500\n",
      "5550\n",
      "5600\n",
      "5650\n",
      "5700\n",
      "5750\n",
      "5800\n",
      "5850\n",
      "5900\n",
      "5950\n",
      "6000\n",
      "6050\n",
      "6100\n",
      "6150\n",
      "6200\n",
      "6250\n",
      "6300\n",
      "6350\n",
      "6400\n",
      "6450\n",
      "6500\n",
      "6550\n",
      "6600\n",
      "6650\n",
      "6700\n",
      "6750\n",
      "6800\n",
      "6850\n",
      "6900\n",
      "6950\n",
      "7000\n",
      "7050\n",
      "7100\n",
      "7150\n",
      "7200\n",
      "7250\n",
      "7300\n",
      "7350\n",
      "7400\n",
      "7450\n",
      "7500\n",
      "7550\n",
      "7600\n",
      "7650\n",
      "7700\n",
      "7750\n",
      "7800\n",
      "7850\n",
      "7900\n",
      "7950\n",
      "8000\n",
      "8050\n",
      "8100\n",
      "8150\n",
      "8200\n",
      "8250\n",
      "8300\n",
      "8350\n",
      "8400\n",
      "8450\n",
      "8500\n",
      "8550\n",
      "8600\n",
      "8650\n",
      "8700\n",
      "8750\n",
      "8800\n",
      "8850\n",
      "8900\n",
      "8950\n",
      "9000\n",
      "9050\n",
      "9100\n",
      "9150\n",
      "9200\n",
      "9250\n",
      "9300\n",
      "9350\n",
      "9400\n",
      "9450\n",
      "9500\n",
      "9550\n",
      "9600\n",
      "9650\n",
      "9700\n",
      "9750\n",
      "9800\n",
      "9850\n",
      "9900\n",
      "9950\n",
      "10000\n",
      "10050\n",
      "10100\n",
      "10150\n",
      "10200\n",
      "10250\n",
      "10300\n",
      "10350\n",
      "10400\n",
      "10450\n",
      "10500\n",
      "10550\n",
      "10600\n",
      "10650\n",
      "10700\n",
      "10750\n",
      "10800\n",
      "10850\n",
      "10900\n",
      "10950\n",
      "11000\n",
      "11050\n",
      "11100\n",
      "11150\n",
      "11200\n",
      "11250\n",
      "11300\n",
      "11350\n",
      "11400\n",
      "11450\n",
      "11500\n",
      "11550\n",
      "11600\n",
      "11650\n",
      "11700\n",
      "11750\n",
      "11800\n",
      "11850\n",
      "11900\n",
      "11950\n",
      "12000\n",
      "12050\n",
      "12100\n",
      "12150\n",
      "12200\n",
      "12250\n",
      "12300\n",
      "12350\n",
      "12400\n",
      "12450\n",
      "12500\n",
      "12550\n",
      "12600\n",
      "12650\n",
      "12700\n",
      "12750\n",
      "12800\n",
      "12850\n",
      "12900\n",
      "12950\n",
      "13000\n",
      "13050\n",
      "13100\n",
      "13150\n",
      "13200\n",
      "13250\n",
      "13300\n",
      "13350\n",
      "13400\n",
      "13450\n",
      "13500\n",
      "13550\n",
      "13600\n",
      "13650\n",
      "13700\n",
      "13750\n",
      "13800\n",
      "13850\n",
      "13900\n",
      "13950\n",
      "14000\n",
      "14050\n",
      "14100\n",
      "14150\n",
      "14200\n",
      "14250\n",
      "14300\n",
      "14350\n",
      "14400\n",
      "14450\n",
      "14500\n",
      "14550\n",
      "14600\n",
      "14650\n",
      "14700\n",
      "14750\n",
      "14800\n",
      "14850\n",
      "14900\n",
      "14950\n",
      "15000\n",
      "15050\n",
      "15100\n",
      "15150\n",
      "15200\n",
      "15250\n",
      "15300\n",
      "15350\n",
      "15400\n",
      "15450\n",
      "15500\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "userstream = graph.run(\n",
    "    \"MATCH (t:Tweet) \" +\n",
    "    \"WHERE t.created_at > 0 \" +\n",
    "    \"WITH t, t.created_at as ts ORDER BY ts ASC \" +\n",
    "    \"MATCH (t:Tweet)<-[:TWEETED]-(u:User) \" +\n",
    "    \"RETURN DISTINCT u.user_id\")\n",
    "\n",
    "i = 0\n",
    "\n",
    "for user in userstream:\n",
    "    # print(user['u.user_id'])\n",
    "    assign_parent(user['u.user_id'])\n",
    "    i += 1\n",
    "    if i % 50 == 0:\n",
    "        print(i)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Speedup via multiprocessing is possible but apparently the new `run` method by py2neo seems not to be working well with it. For larger datasets refactor, maybe with official db driver by Neo4j."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "51047\n"
     ]
    }
   ],
   "source": [
    "print(i)"
   ]
  }
 ],
 "metadata": {
  "anaconda-cloud": {},
  "kernelspec": {
   "display_name": "Python [brexit]",
   "language": "python",
   "name": "Python [brexit]"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
